---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.EdgeTwiceUsedByFace
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.EdgeTwiceUsedByFace

A face with an edge encountered in the loops multiple times.
 Associated numbers are face and loop in which the problem became
 obvious indices respectively.